MarlinFirmware/Marlin/Marlin/lib/h32_core/hdsc/library/src/hc32f46x_clk.c
/*******************************************************************************
 * Copyright (C) 2016, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software is owned and published by:
 * Huada Semiconductor Co., Ltd. ("HDSC").
 *
 * BY DOWNLOADING, INSTALLING OR USING THIS SOFTWARE, YOU AGREE TO BE BOUND
 * BY ALL THE TERMS AND CONDITIONS OF THIS AGREEMENT.
 *
 * This software contains source code for use with HDSC
 * components. This software is licensed by HDSC to be adapted only
 * for use in systems utilizing HDSC components. HDSC shall not be
 * responsible for misuse or illegal use of this software for devices not
 * supported herein. HDSC is providing this software "AS IS" and will
 * not be responsible for issues arising from incorrect user implementation
 * of the software.
 *
 * Disclaimer:
 * HDSC MAKES NO WARRANTY, EXPRESS OR IMPLIED, ARISING BY LAW OR OTHERWISE,
 * REGARDING THE SOFTWARE (INCLUDING ANY ACCOMPANYING WRITTEN MATERIALS),
 * ITS PERFORMANCE OR SUITABILITY FOR YOUR INTENDED USE, INCLUDING,
 * WITHOUT LIMITATION, THE IMPLIED WARRANTY OF MERCHANTABILITY, THE IMPLIED
 * WARRANTY OF FITNESS FOR A PARTICULAR PURPOSE OR USE, AND THE IMPLIED
 * WARRANTY OF NONINFRINGEMENT.
 * HDSC SHALL HAVE NO LIABILITY (WHETHER IN CONTRACT, WARRANTY, TORT,
 * NEGLIGENCE OR OTHERWISE) FOR ANY DAMAGES WHATSOEVER (INCLUDING, WITHOUT
 * LIMITATION, DAMAGES FOR LOSS OF BUSINESS PROFITS, BUSINESS INTERRUPTION,
 * LOSS OF BUSINESS INFORMATION, OR OTHER PECUNIARY LOSS) ARISING FROM USE OR
 * INABILITY TO USE THE SOFTWARE, INCLUDING, WITHOUT LIMITATION, ANY DIRECT,
 * INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES OR LOSS OF DATA,
 * SAVINGS OR PROFITS,
 * EVEN IF Disclaimer HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * YOU ASSUME ALL RESPONSIBILITIES FOR SELECTION OF THE SOFTWARE TO ACHIEVE YOUR
 * INTENDED RESULTS, AND FOR THE INSTALLATION OF, USE OF, AND RESULTS OBTAINED
 * FROM, THE SOFTWARE.
 *
 * This software may be replicated in part or whole for the licensed use,
 * with the restriction that this Disclaimer and Copyright notice must be
 * included with each copy of this software, whether used in part or whole,
 * at all times.
 */
/******************************************************************************/
/** \file hc32f46x_clk.c
 **
 ** A detailed description is available at
 ** @link CmuGroup Clock description @endlink
 **
 **   - 2018-10-13  1.0  Chengy First version for Device Driver Library of CMU.
 **
 ******************************************************************************/

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32f46x_clk.h"
#include "hc32f46x_utility.h"

#if (DDL_CLK_ENABLE == DDL_ON)

/**
 *******************************************************************************
 ** \addtogroup CmuGroup
 ******************************************************************************/
//@{

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
#define CLK_XTAL_TIMEOUT ((uint16_t)0x1000u)
#define CLK_XTAL32_TIMEOUT ((uint8_t)0x05u)
#define CLK_HRC_TIMEOUT ((uint16_t)0x1000u)
#define CLK_MRC_TIMEOUT ((uint8_t)0x05u)
#define CLK_LRC_TIMEOUT ((uint8_t)0x05u)
#define CLK_MPLL_TIMEOUT ((uint16_t)0x1000u)
#define CLK_UPLL_TIMEOUT ((uint16_t)0x1000u)

/* TBDs 1us based 168M frequency. */
#define CLK_FCG_STABLE ((uint16_t)0xB0u)
#define CLK_SYSCLK_STABLE ((uint16_t)0xB0u)
#define CLK_USBCLK_STABLE ((uint16_t)0xB0u)

#define CLK_PLL_DIV_MIN (2u)
#define CLK_PLL_DIV_MAX (16u)

#define CLK_PLLQ_DIV_MIN (1u)
#define CLK_PLLQ_DIV_MAX (16u)

#define CLK_PLLN_MIN (20u)
#define CLK_PLLN_MAX (480u)

#define CLK_PLLM_MIN (1u)
#define CLK_PLLM_MAX (24u)

#define CLK_UPLLM_MIN (2u)
#define CLK_UPLLM_MAX (24u)

#define CLK_PLL_VCO_IN_MIN (1u * 1000u * 1000u)
#define CLK_PLL_VCO_IN_MAX (24u * 1000u * 1000u)

#define CLK_PLL_VCO_OUT_MIN (240u * 1000u * 1000u)
#define CLK_PLL_VCO_OUT_MAX (480u * 1000u * 1000u)

#define ENABLE_CLOCK_REG_WRITE() (M4_SYSREG->PWR_FPRC |= 0xa501u)
#define DISABLE_CLOCK_REG_WRITE() (M4_SYSREG->PWR_FPRC = (0xa500u | (M4_SYSREG->PWR_FPRC & (uint16_t)(~1u))))

#define ENABLE_CLOCK1_REG_WRITE() (M4_SYSREG->PWR_FPRC |= 0xa502u)
#define DISABLE_CLOCK1_REG_WRITE() (M4_SYSREG->PWR_FPRC = (0xa500u | (M4_SYSREG->PWR_FPRC & (uint16_t)(~2u))))

#define DEFAULT_FCG0 (0xFFFFFAEEul)
#define DEFAULT_FCG1 (0xFFFFFFFFul)
#define DEFAULT_FCG2 (0xFFFFFFFFul)
#define DEFAULT_FCG3 (0xFFFFFFFFul)
#define FCG2_WITHOUT_EMB (0xFFFF7FFFul)

#define FCG0_OFFSET_FCM (16ul)
#define FCG1_OFFSET_CAN (0ul)
#define FCG1_OFFSET_QSPI (3ul)
#define FCG1_OFFSET_USBFS (8ul)
#define FCG1_OFFSET_SPI1 (16ul)
#define FCG1_OFFSET_SPI2 (17ul)
#define FCG1_OFFSET_SPI3 (18ul)
#define FCG1_OFFSET_SPI4 (19ul)
#define FCG3_OFFSET_ADC1 (0ul)
#define FCG3_OFFSET_ADC2 (1ul)
#define FCG3_OFFSET_DAC (4ul)

/*! Parameter validity check for XTAL stablization time \a stb. */
#define IS_XTAL_STB_VALID(stb)       \
    ((ClkXtalStbCycle35 <= (stb)) && \
     (ClkXtalStbCycle8163 >= (stb)))

/*! Parameter validity check for pll source \a src. */
#define IS_PLL_SOURCE(src)       \
    ((ClkPllSrcXTAL == (src)) || \
     (ClkPllSrcHRC == (src)))

/*! Parameter validity check for mpll div \a pllp, pllr, upll div \a pllp, pllq, pllr*/
#define IS_PLL_DIV_VALID(pllx)      \
    ((CLK_PLL_DIV_MIN <= (pllx)) && \
     (CLK_PLL_DIV_MAX >= (pllx)))

/*! Parameter validity check for pll div \a pllq. */
#define IS_PLLQ_DIV_VALID(pllx)      \
    ((CLK_PLLQ_DIV_MIN <= (pllx)) && \
     (CLK_PLLQ_DIV_MAX >= (pllx)))

