MarlinFirmware/Marlin/Marlin/lib/h32_core/hdsc/library/src/hc32f46x_clk.c
/*! Parameter validity check for plln \a plln. */
#define IS_PLLN_VALID(plln)      \
    ((CLK_PLLN_MIN <= (plln)) && \
     (CLK_PLLN_MAX >= (plln)))

/*! Parameter validity check for pllm \a pllm. */
#define IS_PLLM_VALID(pllm)      \
    ((CLK_PLLM_MIN <= (pllm)) && \
     (CLK_PLLM_MAX >= (pllm)))

/*! Parameter validity check for pllm \a pllm. */
#define IS_UPLLM_VALID(pllm)      \
    ((CLK_UPLLM_MIN <= (pllm)) && \
     (CLK_UPLLM_MAX >= (pllm)))

/*! Parameter validity check for pllsource/pllm \a vco_in. */
#define IS_PLL_VCO_IN_VALID(vco_in)      \
    ((CLK_PLL_VCO_IN_MIN <= (vco_in)) && \
     (CLK_PLL_VCO_IN_MAX >= (vco_in)))

/*! Parameter validity check for pllsource/pllm*plln \a vco_out. */
#define IS_PLL_VCO_OUT_VALID(vco_out)      \
    ((CLK_PLL_VCO_OUT_MIN <= (vco_out)) && \
     (CLK_PLL_VCO_OUT_MAX >= (vco_out)))

/*! Parameter validity check for system clock source \a syssrc. */
#define IS_SYSCLK_SOURCE(syssrc)    \
    ((ClkSysSrcHRC == (syssrc)) ||  \
     ((ClkSysSrcMRC <= (syssrc)) && \
      (CLKSysSrcMPLL >= (syssrc))))

/*! Parameter validity check for usb clock source \a usbsrc. */
#define IS_USBCLK_SOURCE(usbsrc)         \
    (((ClkUsbSrcSysDiv2 <= (usbsrc)) &&  \
      (ClkUsbSrcSysDiv4 >= (usbsrc))) || \
     ((ClkUsbSrcMpllp <= (usbsrc)) &&    \
      (ClkUsbSrcUpllr >= (usbsrc))))

/*! Parameter validity check for peripheral(adc/trng/I2S) clock source \a adcsrc. */
#define IS_PERICLK_SOURCE(adcsrc)      \
    ((ClkPeriSrcPclk == (adcsrc)) ||   \
     ((ClkPeriSrcMpllp <= (adcsrc)) && \
      (ClkPeriSrcUpllr >= (adcsrc))))

/*! Parameter validity check for output clock source \a outsrc. */
#define IS_OUTPUTCLK_SOURCE(outsrc)      \
    ((ClkOutputSrcHrc == (outsrc)) ||    \
     (ClkOutputSrcMrc == (outsrc)) ||    \
     (ClkOutputSrcLrc == (outsrc)) ||    \
     (ClkOutputSrcXtal == (outsrc)) ||   \
     (ClkOutputSrcXtal32 == (outsrc)) || \
     (ClkOutputSrcMpllp == (outsrc)) ||  \
     (ClkOutputSrcUpllp == (outsrc)) ||  \
     (ClkOutputSrcMpllq == (outsrc)) ||  \
     (ClkOutputSrcUpllq == (outsrc)) ||  \
     (ClkOutputSrcSysclk == (outsrc)))

/*! Parameter validity check for fcm source \a fcmsrc. */
#define IS_FCM_SOURCE(fcmsrc)          \
    ((ClkFcmSrcXtal == (fcmsrc)) ||    \
     ((ClkFcmSrcXtal32 <= (fcmsrc)) && \
      (ClkFcmSrcRtcLrc >= (fcmsrc))))

/*! Parameter validity check for output clock channel \a outch. */
#define IS_OUTPUTCLK_CHANNEL(outch) \
    ((ClkOutputCh1 == (outch)) ||   \
     (ClkOutputCh2 == (outch)))

/*! Parameter validity check for fcm reference \a ref. */
#define IS_FCM_REF(ref)         \
    ((ClkFcmExtRef == (ref)) || \
     (ClkFcmInterRef == (ref)))

/*! Parameter validity check for fcm edge \a edge. */
#define IS_FCM_EDGE(edge)             \
    ((ClkFcmEdgeRising == (edge)) ||  \
     (ClkFcmEdgeFalling == (edge)) || \
     (ClkFcmEdgeBoth == (edge)))

/*! Parameter validity check for fcm filter clock \a clk. */
#define IS_FCM_FILTER_CLK(clk)               \
    ((ClkFcmFilterClkNone == (clk)) ||       \
     (ClkFcmFilterClkFcmSrc == (clk)) ||     \
     (ClkFcmFilterClkFcmSrcDiv4 == (clk)) || \
     (ClkFcmFilterClkFcmSrcDiv16 == (clk)))

/*! Parameter validity check for fcm abnormal handle \a handle. */
#define IS_FCM_HANDLE(handle)               \
    ((ClkFcmHandleInterrupt == (handle)) || \
     (ClkFcmHandleReset == (handle)))

/*! Parameter validity check for debug clock division \a div. */
#define IS_TPIUCLK_DIV_VALID(div) \
    ((ClkTpiuclkDiv1 == (div)) || \
     (ClkTpiuclkDiv2 == (div)) || \
     (ClkTpiuclkDiv4 == (div)))

/*! Parameter validity check for output clock division \a div. */
#define IS_OUTPUTCLK_DIV_VALID(div) \
    ((ClkOutputDiv1 == (div)) ||    \
     ((ClkOutputDiv2 <= (div)) &&   \
      (ClkOutputDiv128 >= (div))))

/*! Parameter validity check for fcm measurement source division \a div. */
#define IS_FCM_MEASRC_DIV_VALID(div) \
    ((ClkFcmMeaDiv1 == (div)) ||     \
     (ClkFcmMeaDiv4 == (div)) ||     \
     (ClkFcmMeaDiv8 == (div)) ||     \
     (ClkFcmMeaDiv32 == (div)))

/*! Parameter validity check for internal reference source division \a div. */
#define IS_FCM_INTREF_DIV_VALID(div)   \
    ((ClkFcmIntrefDiv32 == (div)) ||   \
     (ClkFcmIntrefDiv128 == (div)) ||  \
     (ClkFcmIntrefDiv1024 == (div)) || \
     (ClkFcmIntrefDiv8192 == (div)))

/*! Parameter validity check for system clock config \a cfg. */
#define IS_SYSCLK_CONFIG_VALID(cfg)                   \
    (((cfg)->enHclkDiv <= ((cfg)->enPclk1Div)) &&     \
     ((cfg)->enHclkDiv <= ((cfg)->enPclk3Div)) &&     \
     ((cfg)->enHclkDiv <= ((cfg)->enPclk4Div)) &&     \
     ((cfg)->enPclk0Div <= ((cfg)->enPclk1Div)) &&    \
     ((cfg)->enPclk0Div <= ((cfg)->enPclk3Div)) &&    \
     (((cfg)->enPclk2Div - (cfg)->enPclk4Div == 3) || \
      ((cfg)->enPclk2Div - (cfg)->enPclk4Div == 2) || \
      ((cfg)->enPclk2Div - (cfg)->enPclk4Div == 1) || \
      ((cfg)->enPclk2Div - (cfg)->enPclk4Div == 0) || \
      ((cfg)->enPclk4Div - (cfg)->enPclk2Div == 1) || \
      ((cfg)->enPclk4Div - (cfg)->enPclk2Div == 2) || \
      ((cfg)->enPclk4Div - (cfg)->enPclk2Div == 3)))

/*! Parameter validity check for clock status \a flag. */
#define IS_CLK_FLAG(flag)          \
    ((ClkFlagHRCRdy == (flag)) ||  \
     (ClkFlagXTALRdy == (flag)) || \
     (ClkFlagMPLLRdy == (flag)) || \
     (ClkFlagUPLLRdy == (flag)) || \
     (ClkFlagXTALStoppage == (flag)))
/*! Parameter validity check for fcm status \a flag. */
#define IS_FCM_FLAG(flag)           \
    ((ClkFcmFlagOvf == (flag)) ||   \
     (ClkFcmFlagMendf == (flag)) || \
     (ClkFcmFlagErrf == (flag)))

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

