MarlinFirmware/Marlin/Marlin/lib/h32_core/hdsc/library/src/hc32f46x_clk.c
    DISABLE_CLOCK_REG_WRITE();

    return enRet;
}

/**
 *******************************************************************************
 ** \brief  Trim the internal high speed oscillator(HRC).
 **
 ** \param  [in] trimValue              The trim value.
 **
 ** \retval None
 **
 ** \note   None
 **
 ******************************************************************************/
void CLK_HrcTrim(int8_t trimValue)
{
    ENABLE_CLOCK_REG_WRITE();

    M4_SYSREG->CMU_HRCTRM = trimValue;

    DISABLE_CLOCK_REG_WRITE();
}

/**
 *******************************************************************************
 ** \brief  Enable or disable the HRC.
 **
 ** \param  [in] enNewState             The new state of the HRC.
 ** \arg    Enable                      Enable HRC.
 ** \arg    Disable                     Disable HRC.
 **
 ** \retval en_result_t
 **
 ** \note   HRC can not be stopped if it is used as system clock source or pll
 **         clock source.
 **
 ******************************************************************************/
en_result_t CLK_HrcCmd(en_functional_state_t enNewState)
{
    __IO uint32_t timeout = 0ul;
    en_flag_status_t status;
    en_result_t enRet = Ok;

    ENABLE_CLOCK_REG_WRITE();

    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));
    if (Disable == enNewState)
    {
        if (ClkSysSrcHRC == M4_SYSREG->CMU_CKSWR_f.CKSW)
        {
            enRet = Error;
        }
        else if (ClkPllSrcHRC == M4_SYSREG->CMU_PLLCFGR_f.PLLSRC)
        {
            if (0u == M4_SYSREG->CMU_PLLCR_f.MPLLOFF)
            {
                enRet = Error;
            }
            else
            {
                M4_SYSREG->CMU_HRCCR_f.HRCSTP = 1u;
            }
        }
        else
        {
            M4_SYSREG->CMU_HRCCR_f.HRCSTP = 1u;
        }
    }
    else
    {
        M4_SYSREG->CMU_HRCCR_f.HRCSTP = 0u;
        do
        {
            status = CLK_GetFlagStatus(ClkFlagHRCRdy);
            timeout++;
        } while ((timeout < CLK_HRC_TIMEOUT) && (status != Set));
    }

    DISABLE_CLOCK_REG_WRITE();

    return enRet;
}

/**
 *******************************************************************************
 ** \brief  Trim the internal middle speed oscillator(MRC).
 **
 ** \param  [in] trimValue              The trim value.
 **
 ** \retval None
 **
 ** \note   None
 **
 ******************************************************************************/
void CLK_MrcTrim(int8_t trimValue)
{
    ENABLE_CLOCK_REG_WRITE();

    M4_SYSREG->CMU_MRCTRM = trimValue;

    DISABLE_CLOCK_REG_WRITE();
}

/**
 *******************************************************************************
 ** \brief  Enable or disable the MRC.
 **
 ** \param  [in] enNewState             The new state of the MRC.
 ** \arg    Enable                      Enable MRC.
 ** \arg    Disable                     Disable MRC.
 **
 ** \retval en_result_t
 **
 ** \note   MRC can not be stopped if it is used as system clock source.
 **
 ******************************************************************************/
en_result_t CLK_MrcCmd(en_functional_state_t enNewState)
{
    __IO uint32_t timeout = 0ul;
    en_result_t enRet = Ok;

    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    ENABLE_CLOCK_REG_WRITE();

    if (Disable == enNewState)
    {
        if (ClkSysSrcMRC == M4_SYSREG->CMU_CKSWR_f.CKSW)
        {
            enRet = Error;
        }
        else
        {
            M4_SYSREG->CMU_MRCCR_f.MRCSTP = 1u;
        }
    }
    else
    {
        M4_SYSREG->CMU_MRCCR_f.MRCSTP = 0u;
        do
        {
            timeout++;
        } while (timeout < CLK_MRC_TIMEOUT);
    }

    DISABLE_CLOCK_REG_WRITE();

    return enRet;
}

/**
 *******************************************************************************
 ** \brief  Trim the internal low speed oscillator(LRC).
 **
 ** \param  [in] trimValue              The trim value.
 **
 ** \retval None
 **
 ** \note   None
 **
 ******************************************************************************/
void CLK_LrcTrim(int8_t trimValue)
{
    ENABLE_CLOCK_REG_WRITE();

    M4_SYSREG->CMU_LRCTRM = trimValue;

    DISABLE_CLOCK_REG_WRITE();
}

/**
 *******************************************************************************
 ** \brief  Enable or disable the LRC.
 **
 ** \param  [in] enNewState             The new state of the LRC.
 ** \arg    Enable                      Enable LRC.
 ** \arg    Disable                     Disable LRC.
 **
 ** \retval en_result_t
 **
 ** \note   LRC can not be stopped if it is used as system clock source.
 **
 ******************************************************************************/
en_result_t CLK_LrcCmd(en_functional_state_t enNewState)
{
    __IO uint32_t timeout = 0ul;
    en_result_t enRet = Ok;

    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    ENABLE_CLOCK_REG_WRITE();

    if (Disable == enNewState)
    {
        if (ClkSysSrcLRC == M4_SYSREG->CMU_CKSWR_f.CKSW)
        {
            enRet = Error;
        }
        else
        {
            M4_SYSREG->CMU_LRCCR_f.LRCSTP = 1u;
        }
    }
    else
    {
        M4_SYSREG->CMU_LRCCR_f.LRCSTP = 0u;
        do
        {
            timeout++;
        } while (timeout < CLK_LRC_TIMEOUT);
    }

    DISABLE_CLOCK_REG_WRITE();

    return enRet;
}

/**
 *******************************************************************************
 ** \brief  Select pll clock source.
 **
 ** \param  [in] enPllSrc               The pll clock source.
 ** \arg    ClkPllSrcXTAL               Select XTAL as pll clock source.
 ** \arg    ClkPllSrcHRC                Select HRC as pll clock source.
 **
 ** \retval None
 **
 ** \note   None
 **
 ******************************************************************************/
void CLK_SetPllSource(en_clk_pll_source_t enPllSrc)
{
    DDL_ASSERT(IS_PLL_SOURCE(enPllSrc));

    ENABLE_CLOCK_REG_WRITE();

    M4_SYSREG->CMU_PLLCFGR_f.PLLSRC = enPllSrc;

    DISABLE_CLOCK_REG_WRITE();
}

/**
 *******************************************************************************
 ** \brief  Configures the MPLL.
 **
 ** \param  [in] pstcMpllCfg            The MPLL configures struct.
 **
 ** \retval None
 **
 ** \note   The pllsource/pllm is between 1MHz and 24MHz.
 **         The pllsource/pllm*plln is between 240MHz and 480MHz.
 **         The maximum of pllsource/pllm*plln/pllp is 200MHz.
 **
 ******************************************************************************/
void CLK_MpllConfig(const stc_clk_mpll_cfg_t *pstcMpllCfg)
{
#ifdef __DEBUG
    uint32_t vcoIn = 0ul;
    uint32_t vcoOut = 0ul;
#endif /* #ifdef __DEBUG */

