MarlinFirmware/Marlin/Marlin/lib/h32_core/hdsc/library/src/hc32f46x_clk.c
    if (NULL != pstcMpllCfg)
    {
        DDL_ASSERT(IS_PLL_DIV_VALID(pstcMpllCfg->PllpDiv));
        DDL_ASSERT(IS_PLLQ_DIV_VALID(pstcMpllCfg->PllqDiv));
        DDL_ASSERT(IS_PLL_DIV_VALID(pstcMpllCfg->PllrDiv));
        DDL_ASSERT(IS_PLLN_VALID(pstcMpllCfg->plln));
        DDL_ASSERT(IS_PLLM_VALID(pstcMpllCfg->pllmDiv));

#ifdef __DEBUG
        vcoIn = ((ClkPllSrcXTAL == M4_SYSREG->CMU_PLLCFGR_f.PLLSRC ? XTAL_VALUE : HRC_VALUE) / pstcMpllCfg->pllmDiv);
        vcoOut = vcoIn * pstcMpllCfg->plln;

        DDL_ASSERT(IS_PLL_VCO_IN_VALID(vcoIn));
        DDL_ASSERT(IS_PLL_VCO_OUT_VALID(vcoOut));
#endif /* #ifdef __DEBUG */

        ENABLE_CLOCK_REG_WRITE();

        M4_SYSREG->CMU_PLLCFGR_f.MPLLP = pstcMpllCfg->PllpDiv - 1ul;
        M4_SYSREG->CMU_PLLCFGR_f.MPLLQ = pstcMpllCfg->PllqDiv - 1ul;
        M4_SYSREG->CMU_PLLCFGR_f.MPLLR = pstcMpllCfg->PllrDiv - 1ul;
        M4_SYSREG->CMU_PLLCFGR_f.MPLLN = pstcMpllCfg->plln - 1ul;
        M4_SYSREG->CMU_PLLCFGR_f.MPLLM = pstcMpllCfg->pllmDiv - 1ul;

        DISABLE_CLOCK_REG_WRITE();
    }
    else
    {
        /* code */
    }
}

/**
 *******************************************************************************
 ** \brief  Enable or disable the MPLL.
 **
 ** \param  [in] enNewState             The new state of the MPLL.
 ** \arg    Enable                      Enable MPLL.
 ** \arg    Disable                     Disable MPLL.
 **
 ** \retval en_result_t
 **
 ** \note   MPLL can not be stopped if it is used as system clock source.
 **
 ******************************************************************************/
en_result_t CLK_MpllCmd(en_functional_state_t enNewState)
{
    __IO uint32_t timeout = 0ul;
    en_flag_status_t status;
    en_result_t enRet = Ok;

    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    ENABLE_CLOCK_REG_WRITE();

    if (Disable == enNewState)
    {
        if (CLKSysSrcMPLL == M4_SYSREG->CMU_CKSWR_f.CKSW)
        {
            enRet = Error;
        }
        else
        {
            M4_SYSREG->CMU_PLLCR_f.MPLLOFF = 1u;
        }
    }
    else
    {
        M4_SYSREG->CMU_PLLCR_f.MPLLOFF = 0u;
        do
        {
            status = CLK_GetFlagStatus(ClkFlagMPLLRdy);
            timeout++;
        } while ((timeout < CLK_MPLL_TIMEOUT) && (status != Set));
    }

    DISABLE_CLOCK_REG_WRITE();

    return enRet;
}

/**
 *******************************************************************************
 ** \brief  Configures the UPLL.
 **
 ** \param  [in] pstcUpllCfg            The UPLL configures struct.
 **
 ** \retval None
 **
 ** \note   The pllsource/pllm is between 1MHz and 24MHz.
 **         The pllsource/pllm*plln is between 240MHz and 480MHz.
 **         The maximum of pllsource/pllm*plln/pllp is 200MHz.
 **
 ******************************************************************************/
void CLK_UpllConfig(const stc_clk_upll_cfg_t *pstcUpllCfg)
{
#ifdef __DEBUG
    uint32_t vcoIn = 0ul;
    uint32_t vcoOut = 0ul;
#endif /* #ifdef __DEBUG */

    if (NULL != pstcUpllCfg)
    {
        DDL_ASSERT(IS_PLL_DIV_VALID(pstcUpllCfg->PllpDiv));
        DDL_ASSERT(IS_PLL_DIV_VALID(pstcUpllCfg->PllqDiv));
        DDL_ASSERT(IS_PLL_DIV_VALID(pstcUpllCfg->PllrDiv));
        DDL_ASSERT(IS_PLLN_VALID(pstcUpllCfg->plln));
        DDL_ASSERT(IS_UPLLM_VALID(pstcUpllCfg->pllmDiv));

#ifdef __DEBUG
        vcoIn = ((ClkPllSrcXTAL == M4_SYSREG->CMU_PLLCFGR_f.PLLSRC ? XTAL_VALUE : HRC_VALUE) / pstcUpllCfg->pllmDiv);
        vcoOut = vcoIn * pstcUpllCfg->plln;

        DDL_ASSERT(IS_PLL_VCO_IN_VALID(vcoIn));
        DDL_ASSERT(IS_PLL_VCO_OUT_VALID(vcoOut));
#endif /* #ifdef __DEBUG */

        ENABLE_CLOCK_REG_WRITE();

        M4_SYSREG->CMU_UPLLCFGR_f.UPLLP = pstcUpllCfg->PllpDiv - 1u;
        M4_SYSREG->CMU_UPLLCFGR_f.UPLLQ = pstcUpllCfg->PllqDiv - 1u;
        M4_SYSREG->CMU_UPLLCFGR_f.UPLLR = pstcUpllCfg->PllrDiv - 1u;
        M4_SYSREG->CMU_UPLLCFGR_f.UPLLN = pstcUpllCfg->plln - 1u;
        M4_SYSREG->CMU_UPLLCFGR_f.UPLLM = pstcUpllCfg->pllmDiv - 1u;

        DISABLE_CLOCK_REG_WRITE();
    }
    else
    {
        /* code */
    }
}

/**
 *******************************************************************************
 ** \brief  Enable or disable the UPLL.
 **
 ** \param  [in] enNewState             The new state of the UPLL.
 ** \arg    Enable                      Enable UPLL.
 ** \arg    Disable                     Disable UPLL.
 **
 ** \retval None
 **
 ** \note   None
 **
 ******************************************************************************/
en_result_t CLK_UpllCmd(en_functional_state_t enNewState)
{
    __IO uint32_t timeout = 0ul;
    en_flag_status_t status;

    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    ENABLE_CLOCK_REG_WRITE();

    M4_SYSREG->CMU_UPLLCR_f.UPLLOFF = ((Enable == enNewState) ? 0u : 1u);

    DISABLE_CLOCK_REG_WRITE();

    do
    {
        status = CLK_GetFlagStatus(ClkFlagUPLLRdy);
        timeout++;
    } while ((timeout < CLK_UPLL_TIMEOUT) && (status != ((Enable == enNewState) ? Set : Reset)));

    return Ok;
}

/**
 *******************************************************************************
 ** \brief  Select system clock source.
 **
 ** \param  [in] enTargetSysSrc         The system clock source.
 ** \arg    ClkSysSrcHRC                Select HRC as system clock source.
 ** \arg    ClkSysSrcMRC                Select MRC as system clock source.
 ** \arg    ClkSysSrcLRC                Select LRC as system clock source.
 ** \arg    ClkSysSrcXTAL               Select XTAL as system clock source.
 ** \arg    ClkSysSrcXTAL32             Select XTAL32 as system clock source.
 ** \arg    CLKSysSrcMPLL               Select MPLL as system clock source.
 **
 ** \retval None
 **
 ** \note   Must close all of the fcg register before switch system clock source.
 **
 ******************************************************************************/
void CLK_SetSysClkSource(en_clk_sys_source_t enTargetSysSrc)
{
    __IO uint32_t timeout = 0ul;
    __IO uint32_t fcg0 = M4_MSTP->FCG0;
    __IO uint32_t fcg1 = M4_MSTP->FCG1;
    __IO uint32_t fcg2 = M4_MSTP->FCG2;
    __IO uint32_t fcg3 = M4_MSTP->FCG3;

    DDL_ASSERT(IS_SYSCLK_SOURCE(enTargetSysSrc));

    /* Only current system clock source or target system clock source is MPLL
    need to close fcg0~fcg3 and open fcg0~fcg3 during switch system clock source.
    We need to backup fcg0~fcg3 before close them. */
    if ((CLKSysSrcMPLL == M4_SYSREG->CMU_CKSWR_f.CKSW) ||
        (CLKSysSrcMPLL == enTargetSysSrc))
    {
        /* Close fcg0~fcg3. */
        M4_MSTP->FCG0 = DEFAULT_FCG0;
        M4_MSTP->FCG1 = DEFAULT_FCG1;
        M4_MSTP->FCG2 = DEFAULT_FCG2;
        M4_MSTP->FCG3 = DEFAULT_FCG3;

        /* Wait stable after close fcg. */
        do
        {
            timeout++;
        } while (timeout < CLK_FCG_STABLE);
    }

    /* Switch to target system clock source. */
    ENABLE_CLOCK_REG_WRITE();

    M4_SYSREG->CMU_CKSWR_f.CKSW = enTargetSysSrc;

