MarlinFirmware/Marlin/Marlin/lib/h32_core/hdsc/library/src/hc32f46x_clk.c
    /* Get Upll paramter value */
    upllp = M4_SYSREG->CMU_UPLLCFGR_f.UPLLP;
    upllq = M4_SYSREG->CMU_UPLLCFGR_f.UPLLQ;
    upllr = M4_SYSREG->CMU_UPLLCFGR_f.UPLLR;
    uplln = M4_SYSREG->CMU_UPLLCFGR_f.UPLLN;
    upllm = M4_SYSREG->CMU_UPLLCFGR_f.UPLLM;

    /* Get mpllp ,mpllr, mpllq, upllp, upllq, upllr clock frequency */
    if (ClkPllSrcXTAL == pllsource)
    {
        pstcPllClkFreq->mpllp = (XTAL_VALUE) / (mpllm + 1u) * (mplln + 1u) / (mpllp + 1u);
        pstcPllClkFreq->mpllq = (XTAL_VALUE) / (mpllm + 1u) * (mplln + 1u) / (mpllq + 1u);
        pstcPllClkFreq->mpllr = (XTAL_VALUE) / (mpllm + 1u) * (mplln + 1u) / (mpllr + 1u);
        pstcPllClkFreq->upllp = (XTAL_VALUE) / (upllm + 1u) * (uplln + 1u) / (upllp + 1u);
        pstcPllClkFreq->upllq = (XTAL_VALUE) / (upllm + 1u) * (uplln + 1u) / (upllq + 1u);
        pstcPllClkFreq->upllr = (XTAL_VALUE) / (upllm + 1u) * (uplln + 1u) / (upllr + 1u);
    }
    else if (ClkPllSrcHRC == pllsource)
    {
        pstcPllClkFreq->mpllp = (HRC_VALUE) / (mpllm + 1u) * (mplln + 1u) / (mpllp + 1u);
        pstcPllClkFreq->mpllq = (HRC_VALUE) / (mpllm + 1u) * (mplln + 1u) / (mpllq + 1u);
        pstcPllClkFreq->mpllr = (HRC_VALUE) / (mpllm + 1u) * (mplln + 1u) / (mpllr + 1u);
        pstcPllClkFreq->upllp = (HRC_VALUE) / (upllm + 1u) * (uplln + 1u) / (upllp + 1u);
        pstcPllClkFreq->upllq = (HRC_VALUE) / (upllm + 1u) * (uplln + 1u) / (upllq + 1u);
        pstcPllClkFreq->upllr = (HRC_VALUE) / (upllm + 1u) * (uplln + 1u) / (upllr + 1u);
    }
    else
    {
        /* code */
    }
}

/**
 *******************************************************************************
 ** \brief  Select usb clock source.
 **
 ** \param  [in] enTargetUsbSrc         The usb clock source.
 ** \arg    ClkUsbSrcSysDiv2            Select 1/2 system clock as usb clock source.
 ** \arg    ClkUsbSrcSysDiv3            Select 1/3 system clock as usb clock source.
 ** \arg    ClkUsbSrcSysDiv4            Select 1/4 system clock as usb clock source.
 ** \arg    ClkUsbSrcMpllp              Select MPLLP as usb clock source.
 ** \arg    ClkUsbSrcMpllq              Select MPLLQ as usb clock source.
 ** \arg    ClkUsbSrcMpllr              Select MPLLR as usb clock source.
 ** \arg    ClkUsbSrcUpllp              Select UPLLP as usb clock source.
 ** \arg    ClkUsbSrcUpllq              Select UPLLQ as usb clock source.
 ** \arg    ClkUsbSrcUpllr              Select UPLLR as usb clock source.
 **
 ** \retval None
 **
 ** \note   None
 **
 ******************************************************************************/
void CLK_SetUsbClkSource(en_clk_usb_source_t enTargetUsbSrc)
{
    __IO uint32_t timeout = 0ul;
    __IO uint32_t fcg0 = M4_MSTP->FCG0;
    __IO uint32_t fcg1 = M4_MSTP->FCG1;
    __IO uint32_t fcg2 = M4_MSTP->FCG2;
    __IO uint32_t fcg3 = M4_MSTP->FCG3;

    DDL_ASSERT(IS_USBCLK_SOURCE(enTargetUsbSrc));

    /* Only current system clock source is MPLL need to close fcg0~fcg3 and
    open fcg0~fcg3 during switch USB clock source.
    We need to backup fcg0~fcg3 before close them. */
    if (CLKSysSrcMPLL == M4_SYSREG->CMU_CKSWR_f.CKSW)
    {
        /* Close fcg0~fcg3.Set bit to close it. */
        BIT_SET(M4_MSTP->FCG0, BIT_VALUE(FCG0_OFFSET_FCM));
        BIT_SET(M4_MSTP->FCG1, BIT_VALUE(FCG1_OFFSET_CAN) |
                                   BIT_VALUE(FCG1_OFFSET_QSPI) |
                                   BIT_VALUE(FCG1_OFFSET_USBFS) |
                                   BIT_VALUE(FCG1_OFFSET_SPI1) |
                                   BIT_VALUE(FCG1_OFFSET_SPI2) |
                                   BIT_VALUE(FCG1_OFFSET_SPI3) |
                                   BIT_VALUE(FCG1_OFFSET_SPI4));

        M4_MSTP->FCG2 = FCG2_WITHOUT_EMB | fcg2;

        BIT_SET(M4_MSTP->FCG3, BIT_VALUE(FCG3_OFFSET_ADC1) |
                                   BIT_VALUE(FCG3_OFFSET_ADC2) |
                                   BIT_VALUE(FCG3_OFFSET_DAC));

        /* Wait stable after close fcg. */
        do
        {
            timeout++;
        } while (timeout < CLK_FCG_STABLE);
    }

    /* Switch to target usb clock source. */
    ENABLE_CLOCK_REG_WRITE();

    M4_SYSREG->CMU_UFSCKCFGR_f.USBCKS = enTargetUsbSrc;

    DISABLE_CLOCK_REG_WRITE();

    timeout = 0ul;
    do
    {
        timeout++;
    } while (timeout < CLK_USBCLK_STABLE);

    /* Open fcg0~fcg3. Write the backup value. */
    M4_MSTP->FCG0 = fcg0;
    M4_MSTP->FCG1 = fcg1;
    M4_MSTP->FCG2 = fcg2;
    M4_MSTP->FCG3 = fcg3;

    /* Wait stable after open fcg. */
    timeout = 0ul;
    do
    {
        timeout++;
    } while (timeout < CLK_FCG_STABLE);
}

/**
 *******************************************************************************
 ** \brief  Select peripheral(adc/trng) clock source.
 **
 ** \param  [in] enTargetPeriSrc        The  peripheral(adc/trng) clock source.
 ** \arg    ClkPeriSrcPclk              Select PCLK2 as adc analog clok, PCLK4 as adc digital clock. Select PCLK4 as trng clock.
 ** \arg    ClkPeriSrcMpllp             Select MPLLP as peripheral(adc/trng) clock source.
 ** \arg    ClkPeriSrcMpllq             Select MPLLQ as peripheral(adc/trng) clock source.
 ** \arg    ClkPeriSrcMpllr             Select MPLLR as peripheral(adc/trng) clock source.
 ** \arg    ClkPeriSrcUpllp             Select UPLLP as peripheral(adc/trng) clock source.
 ** \arg    ClkPeriSrcUpllq             Select UPLLQ as peripheral(adc/trng) clock source.
 ** \arg    ClkPeriSrcUpllr             Select UPLLR as peripheral(adc/trng) clock source.
 **
 ** \retval None
 **
 ** \note   Must close usb,ether,exbus,can,qspi,spi,timer,fcm,adc and dac
 **         before switch adc clock source.
 **
 ******************************************************************************/
void CLK_SetPeriClkSource(en_clk_peri_source_t enTargetPeriSrc)
{
    DDL_ASSERT(IS_PERICLK_SOURCE(enTargetPeriSrc));

    ENABLE_CLOCK1_REG_WRITE();

    /* Switch to target adc clock source. */
    M4_SYSREG->CMU_PERICKSEL_f.PERICKSEL = enTargetPeriSrc;

    DISABLE_CLOCK1_REG_WRITE();
}

/**
 *******************************************************************************
 ** \brief  Select I2S clock source.
 **
 ** \param  [in] pstcI2sReg             Pointer to I2S register
 ** \arg    M4_I2S1                     I2s channel 1
 ** \arg    M4_I2S2                     I2s channel 2
 ** \arg    M4_I2S3                     I2s channel 3
 ** \arg    M4_I2S4                     I2s channel 4
 ** \param  [in] enTargetPeriSrc        The  I2S clock source.
 ** \arg    ClkPeriSrcPclk              Select PCLK3 as I2S clock source.
 ** \arg    ClkPeriSrcMpllp             Select MPLLP as I2S clock source.
 ** \arg    ClkPeriSrcMpllq             Select MPLLQ as I2S clock source.
 ** \arg    ClkPeriSrcMpllr             Select MPLLR as I2S clock source.
 ** \arg    ClkPeriSrcUpllp             Select UPLLP as I2S clock source.
 ** \arg    ClkPeriSrcUpllq             Select UPLLQ as I2S clock source.
 ** \arg    ClkPeriSrcUpllr             Select UPLLR as I2S clock source.
 **
 ** \retval None
 **
 ** \note   None
 **
 ******************************************************************************/
void CLK_SetI2sClkSource(const M4_I2S_TypeDef *pstcI2sReg, en_clk_peri_source_t enTargetPeriSrc)
{
    DDL_ASSERT(IS_PERICLK_SOURCE(enTargetPeriSrc));

    ENABLE_CLOCK1_REG_WRITE();

    if (M4_I2S1 == pstcI2sReg)
    {
        M4_SYSREG->CMU_I2SCKSEL_f.I2S1CKSEL = enTargetPeriSrc;
    }
    else if (M4_I2S2 == pstcI2sReg)
    {
        M4_SYSREG->CMU_I2SCKSEL_f.I2S2CKSEL = enTargetPeriSrc;
    }
    else if (M4_I2S3 == pstcI2sReg)
    {
        M4_SYSREG->CMU_I2SCKSEL_f.I2S3CKSEL = enTargetPeriSrc;
    }
    else if (M4_I2S4 == pstcI2sReg)
    {
        M4_SYSREG->CMU_I2SCKSEL_f.I2S4CKSEL = enTargetPeriSrc;
    }
    else
    {
        /* code */
    }

