MarlinFirmware/Marlin/Marlin/lib/h32_core/hdsc/library/src/hc32f46x_clk.c
    return status;
}

/**
 *******************************************************************************
 ** \brief  Configures the clock frequency measurement.
 **
 ** \param  [in] pstcClkFcmCfg          The clock frequency measurement configures
 **                                     struct.
 **
 ** \retval None
 **
 ** \note   Configures the window,measurement,reference and interrupt independently.
 **
 ******************************************************************************/
void CLK_FcmConfig(const stc_clk_fcm_cfg_t *pstcClkFcmCfg)
{
    if (NULL != pstcClkFcmCfg)
    {
        /* Window config. */
        if (pstcClkFcmCfg->pstcFcmWindowCfg)
        {
            /* Set window lower. */
            M4_FCM->LVR = pstcClkFcmCfg->pstcFcmWindowCfg->windowLower;
            /* Set window upper. */
            M4_FCM->UVR = pstcClkFcmCfg->pstcFcmWindowCfg->windowUpper;
        }

        /* Measure config. */
        if (pstcClkFcmCfg->pstcFcmMeaCfg)
        {
            DDL_ASSERT(IS_FCM_SOURCE(pstcClkFcmCfg->pstcFcmMeaCfg->enSrc));
            DDL_ASSERT(IS_FCM_MEASRC_DIV_VALID(pstcClkFcmCfg->pstcFcmMeaCfg->enSrcDiv));

            /* Measure source. */
            M4_FCM->MCCR_f.MCKS = pstcClkFcmCfg->pstcFcmMeaCfg->enSrc;
            /* Measure source division. */
            M4_FCM->MCCR_f.MDIVS = pstcClkFcmCfg->pstcFcmMeaCfg->enSrcDiv;
        }

        /* Reference config. */
        if (pstcClkFcmCfg->pstcFcmRefCfg)
        {
            DDL_ASSERT(IS_FCM_REF(pstcClkFcmCfg->pstcFcmRefCfg->enRefSel));
            DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcClkFcmCfg->pstcFcmRefCfg->enExtRef));
            DDL_ASSERT(IS_FCM_SOURCE(pstcClkFcmCfg->pstcFcmRefCfg->enIntRefSrc));
            DDL_ASSERT(IS_FCM_INTREF_DIV_VALID(pstcClkFcmCfg->pstcFcmRefCfg->enIntRefDiv));
            DDL_ASSERT(IS_FCM_EDGE(pstcClkFcmCfg->pstcFcmRefCfg->enEdge));
            DDL_ASSERT(IS_FCM_FILTER_CLK(pstcClkFcmCfg->pstcFcmRefCfg->enFilterClk));

            M4_FCM->RCCR_f.INEXS = pstcClkFcmCfg->pstcFcmRefCfg->enRefSel;
            M4_FCM->RCCR_f.EXREFE = pstcClkFcmCfg->pstcFcmRefCfg->enExtRef;
            M4_FCM->RCCR_f.RCKS = pstcClkFcmCfg->pstcFcmRefCfg->enIntRefSrc;
            M4_FCM->RCCR_f.RDIVS = pstcClkFcmCfg->pstcFcmRefCfg->enIntRefDiv;
            M4_FCM->RCCR_f.EDGES = pstcClkFcmCfg->pstcFcmRefCfg->enEdge;
            M4_FCM->RCCR_f.DNFS = pstcClkFcmCfg->pstcFcmRefCfg->enFilterClk;
        }

        /* Interrupt config. */
        if (pstcClkFcmCfg->pstcFcmIntCfg)
        {
            DDL_ASSERT(IS_FCM_HANDLE(pstcClkFcmCfg->pstcFcmIntCfg->enHandleSel));
            DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcClkFcmCfg->pstcFcmIntCfg->enHandleReset));
            DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcClkFcmCfg->pstcFcmIntCfg->enHandleInterrupt));
            DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcClkFcmCfg->pstcFcmIntCfg->enOvfInterrupt));
            DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcClkFcmCfg->pstcFcmIntCfg->enEndInterrupt));

            M4_FCM->RIER_f.ERRINTRS = pstcClkFcmCfg->pstcFcmIntCfg->enHandleSel;
            M4_FCM->RIER_f.ERRE = pstcClkFcmCfg->pstcFcmIntCfg->enHandleReset;
            M4_FCM->RIER_f.ERRIE = pstcClkFcmCfg->pstcFcmIntCfg->enHandleInterrupt;
            M4_FCM->RIER_f.MENDIE = pstcClkFcmCfg->pstcFcmIntCfg->enEndInterrupt;
            M4_FCM->RIER_f.OVFIE = pstcClkFcmCfg->pstcFcmIntCfg->enOvfInterrupt;
        }
    }
    else
    {
        /* code */
    }
}

/**
 *******************************************************************************
 ** \brief  Enable or disable the clock frequency measurement.
 **
 ** \param  [in] enNewState             The new state of the clock frequency
 **                                     measurement.
 ** \arg    Enable                      Enable clock frequency measurement.
 ** \arg    Disable                     Disable clock frequency measurement.
 **
 ** \retval None
 **
 ** \note   None
 **
 ******************************************************************************/
void CLK_FcmCmd(en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    M4_FCM->STR = enNewState;
}

/**
 *******************************************************************************
 ** \brief  Get fcm counter value.
 **
 ** \param  None
 **
 ** \retval The fcm counter value.
 **
 ** \note   None
 **
 ******************************************************************************/
uint16_t CLK_GetFcmCounter(void)
{
    return (uint16_t)(M4_FCM->CNTR & 0xFFFFu);
}

/**
 *******************************************************************************
 ** \brief  Get the specified fcm flag status.
 **
 ** \param  [in] enFcmFlag              The specified fcm flag.
 ** \arg    ClkFcmFlagOvf               The fcm counter overflow or not.
 ** \arg    ClkFcmFlagMendf             The end of the measurement or not.
 ** \arg    ClkFcmFlagErrf              Whether the frequency is abnormal or not.
 **
 ** \retval None
 **
 ** \note   None
 **
 ******************************************************************************/
en_flag_status_t CLK_GetFcmFlag(en_clk_fcm_flag_t enFcmFlag)
{
    en_flag_status_t status = Reset;

    DDL_ASSERT(IS_FCM_FLAG(enFcmFlag));

    switch (enFcmFlag)
    {
    case ClkFcmFlagOvf:
        status = (en_flag_status_t)M4_FCM->SR_f.OVF;
        break;
    case ClkFcmFlagMendf:
        status = (en_flag_status_t)M4_FCM->SR_f.MENDF;
        break;
    case ClkFcmFlagErrf:
        status = (en_flag_status_t)M4_FCM->SR_f.ERRF;
        break;
    default:
        break;
    }

    return status;
}

/**
 *******************************************************************************
 ** \brief  Clear the specified fcm flag status.
 **
 ** \param  [in] enFcmFlag              The specified fcm flag.
 ** \arg    ClkFcmFlagOvf               Clear the fcm counter overflow flag.
 ** \arg    ClkFcmFlagMendf             Clear the end of the measurement flag.
 ** \arg    ClkFcmFlagErrf              Clear the frequency abnormal flag.
 **
 ** \retval None
 **
 ** \note   None
 **
 ******************************************************************************/
void CLK_ClearFcmFlag(en_clk_fcm_flag_t enFcmFlag)
{
    DDL_ASSERT(IS_FCM_FLAG(enFcmFlag));

    switch (enFcmFlag)
    {
    case ClkFcmFlagOvf:
        M4_FCM->CLR_f.OVFCLR = Set;
        break;
    case ClkFcmFlagMendf:
        M4_FCM->CLR_f.MENDFCLR = Set;
        break;
    case ClkFcmFlagErrf:
        M4_FCM->CLR_f.ERRFCLR = Set;
        break;
    default:
        break;
    }
}

/**
 *******************************************************************************
 ** \brief  Clear the XTAL error flag.
 **
 ** \param  None
 **
 ** \retval None
 **
 ** \note   The system clock should not be XTAL before call this function.
 **
 ******************************************************************************/
void CLK_ClearXtalStdFlag(void)
{
    /* Enable register write. */
    ENABLE_CLOCK_REG_WRITE();

    if (Set == M4_SYSREG->CMU_XTALSTDSR_f.XTALSTDF)
    {
        /* Clear the XTAL STD flag */
        M4_SYSREG->CMU_XTALSTDSR_f.XTALSTDF = Reset;
    }

    /* Disbale register write. */
    DISABLE_CLOCK_REG_WRITE();
}

//@} // CmuGroup

#endif /* DDL_CLK_ENABLE */

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
